# Seattle rain data

The data was pulled from [this Kaggle set](https://www.kaggle.com/rtatman/did-it-rain-in-seattle-19482017). Three rows containing "NA"s have been removed.

The name of the database is `ex_seattle_weather`.

If you think you have found an error in the result set, please open an issue in Github. 

## Date information

Different database engines have different techniques for manipulating dates. You typically won't be marked down for not knowing the date transformations in PostgreSQL vs Oracle vs MySQL vs ......

For the following exercises, it is probably useful to know the EXTRACT command:
```sql
SELECT EXTRACT('month' FROM date_weather) AS month FROM weather LIMIT 5;
```
will return 5 rows with just the month extracted from the `date_weather` column.

In [1]:
%load_ext sql
%sql postgres://localhost/ex_seattle_weather

'Connected: @ex_seattle_weather'

## Questions

1. **Select all rows from December 1st, 2000 to December 15th, 2000 (inclusive)**

In [2]:
%%sql
SELECT 
       * 
FROM 
      weather
WHERE 
      date_weather >= timestamp '2000-12-01'
  AND
      date_weather <= timestamp '2000-12-15'
;

 * postgres://localhost/ex_seattle_weather
15 rows affected.

[(datetime.datetime(2000, 12, 1, 0, 0), 0.04, 55.0, 39.0, True),
 (datetime.datetime(2000, 12, 2, 0, 0), 0.18, 51.0, 37.0, True),
 (datetime.datetime(2000, 12, 3, 0, 0), 0.0, 44.0, 34.0, False),
 (datetime.datetime(2000, 12, 4, 0, 0), 0.0, 51.0, 37.0, False),
 (datetime.datetime(2000, 12, 5, 0, 0), 0.0, 50.0, 36.0, False),
 (datetime.datetime(2000, 12, 6, 0, 0), 0.0, 50.0, 35.0, False),
 (datetime.datetime(2000, 12, 7, 0, 0), 0.0, 40.0, 34.0, False),
 (datetime.datetime(2000, 12, 8, 0, 0), 0.02, 45.0, 30.0, True),
 (datetime.datetime(2000, 12, 9, 0, 0), 0.06, 43.0, 36.0, True),
 (datetime.datetime(2000, 12, 10, 0, 0), 0.0, 40.0, 30.0, False),
 (datetime.datetime(2000, 12, 11, 0, 0), 0.0, 37.0, 28.0, False),
 (datetime.datetime(2000, 12, 12, 0, 0), 0.0, 37.0, 28.0, False),
 (datetime.datetime(2000, 12, 13, 0, 0), 0.0, 37.0, 30.0, False),
 (datetime.datetime(2000, 12, 14, 0, 0), 0.26, 46.0, 28.0, True),
 (datetime.datetime(2000, 12, 15, 0, 0), 0.0, 42.0, 35.0, False)]

2. **Get the average maximum temperature for every year from the year 2000 onward. Order the results by year (ascending)**

In [3]:
%%sql
SELECT 
    DATE_PART('year', date_weather)::int AS year, AVG(temp_max)::numeric(5,2) avg_max_temp
FROM 
    weather
WHERE
    DATE_PART('year', date_weather)::int >= 2000
GROUP BY
    year
ORDER BY 
    year
;

 * postgres://localhost/ex_seattle_weather
18 rows affected.

[(2000, Decimal('58.67')),
 (2001, Decimal('58.47')),
 (2002, Decimal('58.89')),
 (2003, Decimal('60.44')),
 (2004, Decimal('60.62')),
 (2005, Decimal('60.15')),
 (2006, Decimal('61.04')),
 (2007, Decimal('59.20')),
 (2008, Decimal('58.49')),
 (2009, Decimal('59.91')),
 (2010, Decimal('59.66')),
 (2011, Decimal('58.14')),
 (2012, Decimal('59.50')),
 (2013, Decimal('60.90')),
 (2014, Decimal('62.59')),
 (2015, Decimal('63.37')),
 (2016, Decimal('62.55')),
 (2017, Decimal('61.73'))]

3. **Get the standard deviation of the maximum temperature per year, from 2000 onward. Order by year (ascending)**

In [4]:
%%sql
SELECT 
    DATE_PART('year', date_weather)::INT AS year, STDDEV(temp_max)::NUMERIC(5,2) std_dev_temp_max
FROM 
    weather
WHERE
    DATE_PART('year', date_weather)::INT >= 2000
GROUP BY
    year
ORDER BY 
    year
;

 * postgres://localhost/ex_seattle_weather
18 rows affected.

[(2000, Decimal('11.49')),
 (2001, Decimal('11.18')),
 (2002, Decimal('12.31')),
 (2003, Decimal('12.87')),
 (2004, Decimal('12.61')),
 (2005, Decimal('11.89')),
 (2006, Decimal('13.05')),
 (2007, Decimal('12.92')),
 (2008, Decimal('13.00')),
 (2009, Decimal('14.23')),
 (2010, Decimal('11.16')),
 (2011, Decimal('12.45')),
 (2012, Decimal('12.74')),
 (2013, Decimal('13.60')),
 (2014, Decimal('13.08')),
 (2015, Decimal('13.18')),
 (2016, Decimal('12.65')),
 (2017, Decimal('14.20'))]

4. **What are the 10 hottest days on record? Take hottest to mean 'highest maximum temperature'.**

In [5]:
%%sql
SELECT
    DATE(date_weather), temp_max
FROM
    weather
ORDER BY 
    temp_max DESC
LIMIT 10;

 * postgres://localhost/ex_seattle_weather
10 rows affected.

[(datetime.date(2009, 7, 29), 103.0),
 (datetime.date(1994, 7, 20), 100.0),
 (datetime.date(1981, 8, 9), 99.0),
 (datetime.date(1991, 7, 23), 99.0),
 (datetime.date(1960, 8, 9), 99.0),
 (datetime.date(1981, 8, 10), 98.0),
 (datetime.date(1960, 8, 8), 98.0),
 (datetime.date(1988, 9, 2), 98.0),
 (datetime.date(1979, 7, 16), 98.0),
 (datetime.date(1967, 8, 16), 98.0)]

5. **In 2016, what fraction of days did it rain?**

In [6]:
%%sql
WITH rain16 AS (
    SELECT 
        /* count the number of measurements in 2016 as year_days */
        count(*) AS year_days,  
    
        /* count the number of measurements with rain as rain_days */
        SUM(
            CASE 
                WHEN did_rain THEN 1 
                ELSE 0 
            END
        ) AS rain_days
    FROM 
        weather
    WHERE 
        DATE_PART('year', date_weather) = 2016
)
SELECT 
    rain_days, year_days, rain_days::FLOAT/year_days::FLOAT fraction
FROM 
    rain16
;

 * postgres://localhost/ex_seattle_weather
1 rows affected.

[(172, 366, 0.469945355191257)]

6. **What is the 75th percentile for the amount of rain that fell on a day where _there was some rain_ in 2016?**

Hint: This is a somewhat advanced question. There are a couple of ways of approaching it:
  - count the number of rows with some rain, order then, and take the one ranked in the 75th percentile. This works on all RDBMSes.
  - use a PostgreSQL specific command such as `percent_rank` or `percentile_cont`

Note these different results give _slightly_ different answers (it depends on whether you interpolate to find the 75th percentile or not). This would be a more advanced question.

Answer: approximately 0.33 inches

In [7]:
%%sql
SELECT
    PERCENTILE_CONT(.75) WITHIN GROUP (ORDER BY inches_rain ASC)
FROM
    weather
WHERE
    DATE_PART('year', date_weather)::INT = 2016
AND
    did_rain
;

 * postgres://localhost/ex_seattle_weather
1 rows affected.

[(0.330000013113022,)]

7. **What is the 75th percentile for the amount of rain that fell on any day in 2016?**

Answer: approximately 0.15 inches

In [8]:
%%sql
SELECT
    PERCENTILE_CONT(.75) WITHIN GROUP (ORDER BY inches_rain ASC)
FROM
    weather
WHERE
    DATE_PART('year', date_weather)::int = 2016
;

 * postgres://localhost/ex_seattle_weather
1 rows affected.

[(0.150000005960464,)]

8. **Get the 10 years with the hottest average maximum temperature in July. Order from hottest to coolest**

In [9]:
%%sql
SELECT 
    DATE_PART('year', date_weather)::int AS year
    , AVG(temp_max)::NUMERIC(5,2) AS avg_july_temp_max
FROM
    weather
WHERE
    DATE_PART('month', date_weather)::int = 7
GROUP BY 
    DATE_PART('year', date_weather)
ORDER BY 
    AVG(temp_max) DESC
LIMIT 
    10
;

 * postgres://localhost/ex_seattle_weather
10 rows affected.

[(2015, Decimal('82.58')),
 (1958, Decimal('81.42')),
 (2009, Decimal('80.97')),
 (1985, Decimal('80.94')),
 (2014, Decimal('80.42')),
 (1960, Decimal('79.65')),
 (1965, Decimal('79.45')),
 (1990, Decimal('79.19')),
 (2003, Decimal('78.97')),
 (1994, Decimal('78.97'))]

9. **Get the 10 years with the coldest average minimum temperature in December. Order from coolest to hottest**

In [10]:
%%sql
SELECT 
    DATE_PART('year', date_weather)::int AS year
    , AVG(temp_min) AS avg_dec_temp_min
FROM
    weather
WHERE
    DATE_PART('month', date_weather)::int = 12
GROUP BY 
    DATE_PART('year', date_weather)::int
ORDER BY 
    AVG(temp_min) ASC
LIMIT 
    10
;

 * postgres://localhost/ex_seattle_weather
10 rows affected.

[(1990, 30.3870967741935),
 (1948, 30.8064516129032),
 (1985, 30.9354838709677),
 (1951, 31.2258064516129),
 (1964, 31.4838709677419),
 (1983, 31.5161290322581),
 (1968, 32.0322580645161),
 (1984, 32.0967741935484),
 (2009, 32.0967741935484),
 (1978, 32.1612903225806)]

10. **Repeat the last question, but round the temperatures to 3 decimal places**

HINT: If using the `ROUND` function, you will need to cast your results from `REAL` to `NUMERIC` first. There is an issue in PostgreSQL where REAL is not a subclass of NUMERIC. 

Format for casting

```sql
SELECT temp_min::numeric FROM weather
```

In [11]:
%%sql
SELECT 
    DATE_PART('year', date_weather)::int AS year
    , AVG(temp_min)::NUMERIC(5,3) AS avg_dec_temp_min
FROM
    weather
WHERE
    DATE_PART('month', date_weather)::int = 12
GROUP BY 
    DATE_PART('year', date_weather)::int
ORDER BY 
    AVG(temp_min) ASC
LIMIT 
    10;

 * postgres://localhost/ex_seattle_weather
10 rows affected.

[(1990, Decimal('30.387')),
 (1948, Decimal('30.806')),
 (1985, Decimal('30.935')),
 (1951, Decimal('31.226')),
 (1964, Decimal('31.484')),
 (1983, Decimal('31.516')),
 (1968, Decimal('32.032')),
 (1984, Decimal('32.097')),
 (2009, Decimal('32.097')),
 (1978, Decimal('32.161'))]

11. **Given the results of the previous queries, would it be fair to use this data to claim that 2015 had the "hottest July on record"? Why or why not?**

Answer: No SQL for this question, it is about interpretation of results.

There are many different ways to define 'hottest on record' -- by the definition of "highest monthly average temperature" 2015 wins. But the hottest days ever query includes years where the hottest July day was hotter than than any July day in 2015. In general, the average as a metric will not be robust to outliers. Median temperature, or total number of days above some floor might also be ways of determining the hottest July on record.

12. **Give the average inches of rain that fell per day for each month, where the average is taken over 2000 - 2010 (inclusive).**

In [12]:
%%sql
SELECT 
    DATE_PART('month', date_weather)::int as month
    , AVG(inches_rain) as avg_inches_rain
FROM
    weather
WHERE
        date_weather >= timestamp '2000-01-01'
    AND
        date_weather <  timestamp '2011-01-01'
GROUP BY 
    DATE_PART('month', date_weather)
ORDER BY 
    DATE_PART('month', date_weather) ASC
;

 * postgres://localhost/ex_seattle_weather
12 rows affected.

[(1, 0.191612903460248),
 (2, 0.094276527248299),
 (3, 0.113577712622206),
 (4, 0.0853636359626597),
 (5, 0.0680351905699524),
 (6, 0.050181818189043),
 (7, 0.0161290320395724),
 (8, 0.0343695011842024),
 (9, 0.056930091577415),
 (10, 0.115542522634317),
 (11, 0.216242424065642),
 (12, 0.180058650585039)]